ISouthRain/HC32F448-template/.pack/HDSC/HC32F448.1.0.1/Device/Include/HC32F448FAUI.h
/*  Bit definition for MCAN_TXBCR register  */
#define MCAN_TXBCR_CR0_POS                             (0U)
#define MCAN_TXBCR_CR0                                 (0x00000001UL)
#define MCAN_TXBCR_CR1_POS                             (1U)
#define MCAN_TXBCR_CR1                                 (0x00000002UL)
#define MCAN_TXBCR_CR2_POS                             (2U)
#define MCAN_TXBCR_CR2                                 (0x00000004UL)
#define MCAN_TXBCR_CR3_POS                             (3U)
#define MCAN_TXBCR_CR3                                 (0x00000008UL)
#define MCAN_TXBCR_CR4_POS                             (4U)
#define MCAN_TXBCR_CR4                                 (0x00000010UL)
#define MCAN_TXBCR_CR5_POS                             (5U)
#define MCAN_TXBCR_CR5                                 (0x00000020UL)
#define MCAN_TXBCR_CR6_POS                             (6U)
#define MCAN_TXBCR_CR6                                 (0x00000040UL)
#define MCAN_TXBCR_CR7_POS                             (7U)
#define MCAN_TXBCR_CR7                                 (0x00000080UL)
#define MCAN_TXBCR_CR8_POS                             (8U)
#define MCAN_TXBCR_CR8                                 (0x00000100UL)
#define MCAN_TXBCR_CR9_POS                             (9U)
#define MCAN_TXBCR_CR9                                 (0x00000200UL)
#define MCAN_TXBCR_CR10_POS                            (10U)
#define MCAN_TXBCR_CR10                                (0x00000400UL)
#define MCAN_TXBCR_CR11_POS                            (11U)
#define MCAN_TXBCR_CR11                                (0x00000800UL)
#define MCAN_TXBCR_CR12_POS                            (12U)
#define MCAN_TXBCR_CR12                                (0x00001000UL)
#define MCAN_TXBCR_CR13_POS                            (13U)
#define MCAN_TXBCR_CR13                                (0x00002000UL)
#define MCAN_TXBCR_CR14_POS                            (14U)
#define MCAN_TXBCR_CR14                                (0x00004000UL)
#define MCAN_TXBCR_CR15_POS                            (15U)
#define MCAN_TXBCR_CR15                                (0x00008000UL)
#define MCAN_TXBCR_CR16_POS                            (16U)
#define MCAN_TXBCR_CR16                                (0x00010000UL)
#define MCAN_TXBCR_CR17_POS                            (17U)
#define MCAN_TXBCR_CR17                                (0x00020000UL)
#define MCAN_TXBCR_CR18_POS                            (18U)
#define MCAN_TXBCR_CR18                                (0x00040000UL)
#define MCAN_TXBCR_CR19_POS                            (19U)
#define MCAN_TXBCR_CR19                                (0x00080000UL)
#define MCAN_TXBCR_CR20_POS                            (20U)
#define MCAN_TXBCR_CR20                                (0x00100000UL)
#define MCAN_TXBCR_CR21_POS                            (21U)
#define MCAN_TXBCR_CR21                                (0x00200000UL)
#define MCAN_TXBCR_CR22_POS                            (22U)
#define MCAN_TXBCR_CR22                                (0x00400000UL)
#define MCAN_TXBCR_CR23_POS                            (23U)
#define MCAN_TXBCR_CR23                                (0x00800000UL)
#define MCAN_TXBCR_CR24_POS                            (24U)
#define MCAN_TXBCR_CR24                                (0x01000000UL)
#define MCAN_TXBCR_CR25_POS                            (25U)
#define MCAN_TXBCR_CR25                                (0x02000000UL)
#define MCAN_TXBCR_CR26_POS                            (26U)
#define MCAN_TXBCR_CR26                                (0x04000000UL)
#define MCAN_TXBCR_CR27_POS                            (27U)
#define MCAN_TXBCR_CR27                                (0x08000000UL)
#define MCAN_TXBCR_CR28_POS                            (28U)
#define MCAN_TXBCR_CR28                                (0x10000000UL)
#define MCAN_TXBCR_CR29_POS                            (29U)
#define MCAN_TXBCR_CR29                                (0x20000000UL)
#define MCAN_TXBCR_CR30_POS                            (30U)
#define MCAN_TXBCR_CR30                                (0x40000000UL)
#define MCAN_TXBCR_CR31_POS                            (31U)
#define MCAN_TXBCR_CR31                                (0x80000000UL)

/*  Bit definition for MCAN_TXBTO register  */
#define MCAN_TXBTO_TO0_POS                             (0U)
#define MCAN_TXBTO_TO0                                 (0x00000001UL)
#define MCAN_TXBTO_TO1_POS                             (1U)
#define MCAN_TXBTO_TO1                                 (0x00000002UL)
#define MCAN_TXBTO_TO2_POS                             (2U)
#define MCAN_TXBTO_TO2                                 (0x00000004UL)
#define MCAN_TXBTO_TO3_POS                             (3U)
#define MCAN_TXBTO_TO3                                 (0x00000008UL)
#define MCAN_TXBTO_TO4_POS                             (4U)
#define MCAN_TXBTO_TO4                                 (0x00000010UL)
#define MCAN_TXBTO_TO5_POS                             (5U)
#define MCAN_TXBTO_TO5                                 (0x00000020UL)
#define MCAN_TXBTO_TO6_POS                             (6U)
#define MCAN_TXBTO_TO6                                 (0x00000040UL)
#define MCAN_TXBTO_TO7_POS                             (7U)
#define MCAN_TXBTO_TO7                                 (0x00000080UL)
#define MCAN_TXBTO_TO8_POS                             (8U)
#define MCAN_TXBTO_TO8                                 (0x00000100UL)
#define MCAN_TXBTO_TO9_POS                             (9U)
#define MCAN_TXBTO_TO9                                 (0x00000200UL)
#define MCAN_TXBTO_TO10_POS                            (10U)
#define MCAN_TXBTO_TO10                                (0x00000400UL)
#define MCAN_TXBTO_TO11_POS                            (11U)
#define MCAN_TXBTO_TO11                                (0x00000800UL)
#define MCAN_TXBTO_TO12_POS                            (12U)
#define MCAN_TXBTO_TO12                                (0x00001000UL)
#define MCAN_TXBTO_TO13_POS                            (13U)
#define MCAN_TXBTO_TO13                                (0x00002000UL)
#define MCAN_TXBTO_TO14_POS                            (14U)
#define MCAN_TXBTO_TO14                                (0x00004000UL)
#define MCAN_TXBTO_TO15_POS                            (15U)
#define MCAN_TXBTO_TO15                                (0x00008000UL)
#define MCAN_TXBTO_TO16_POS                            (16U)
#define MCAN_TXBTO_TO16                                (0x00010000UL)
#define MCAN_TXBTO_TO17_POS                            (17U)
#define MCAN_TXBTO_TO17                                (0x00020000UL)
#define MCAN_TXBTO_TO18_POS                            (18U)
#define MCAN_TXBTO_TO18                                (0x00040000UL)
#define MCAN_TXBTO_TO19_POS                            (19U)
#define MCAN_TXBTO_TO19                                (0x00080000UL)
#define MCAN_TXBTO_TO20_POS                            (20U)
#define MCAN_TXBTO_TO20                                (0x00100000UL)
#define MCAN_TXBTO_TO21_POS                            (21U)
#define MCAN_TXBTO_TO21                                (0x00200000UL)
#define MCAN_TXBTO_TO22_POS                            (22U)
#define MCAN_TXBTO_TO22                                (0x00400000UL)
#define MCAN_TXBTO_TO23_POS                            (23U)
#define MCAN_TXBTO_TO23                                (0x00800000UL)
#define MCAN_TXBTO_TO24_POS                            (24U)
#define MCAN_TXBTO_TO24                                (0x01000000UL)
#define MCAN_TXBTO_TO25_POS                            (25U)
#define MCAN_TXBTO_TO25                                (0x02000000UL)
#define MCAN_TXBTO_TO26_POS                            (26U)
#define MCAN_TXBTO_TO26                                (0x04000000UL)
#define MCAN_TXBTO_TO27_POS                            (27U)
#define MCAN_TXBTO_TO27                                (0x08000000UL)
#define MCAN_TXBTO_TO28_POS                            (28U)
#define MCAN_TXBTO_TO28                                (0x10000000UL)
#define MCAN_TXBTO_TO29_POS                            (29U)
#define MCAN_TXBTO_TO29                                (0x20000000UL)
#define MCAN_TXBTO_TO30_POS                            (30U)
#define MCAN_TXBTO_TO30                                (0x40000000UL)
#define MCAN_TXBTO_TO31_POS                            (31U)
#define MCAN_TXBTO_TO31                                (0x80000000UL)

/*  Bit definition for MCAN_TXBCF register  */
#define MCAN_TXBCF_CF0_POS                             (0U)
#define MCAN_TXBCF_CF0                                 (0x00000001UL)
#define MCAN_TXBCF_CF1_POS                             (1U)
#define MCAN_TXBCF_CF1                                 (0x00000002UL)
#define MCAN_TXBCF_CF2_POS                             (2U)
#define MCAN_TXBCF_CF2                                 (0x00000004UL)
#define MCAN_TXBCF_CF3_POS                             (3U)
#define MCAN_TXBCF_CF3                                 (0x00000008UL)
#define MCAN_TXBCF_CF4_POS                             (4U)
#define MCAN_TXBCF_CF4                                 (0x00000010UL)
#define MCAN_TXBCF_CF5_POS                             (5U)
#define MCAN_TXBCF_CF5                                 (0x00000020UL)
#define MCAN_TXBCF_CF6_POS                             (6U)
#define MCAN_TXBCF_CF6                                 (0x00000040UL)
#define MCAN_TXBCF_CF7_POS                             (7U)
#define MCAN_TXBCF_CF7                                 (0x00000080UL)
#define MCAN_TXBCF_CF8_POS                             (8U)
#define MCAN_TXBCF_CF8                                 (0x00000100UL)
#define MCAN_TXBCF_CF9_POS                             (9U)
#define MCAN_TXBCF_CF9                                 (0x00000200UL)
#define MCAN_TXBCF_CF10_POS                            (10U)
#define MCAN_TXBCF_CF10                                (0x00000400UL)
#define MCAN_TXBCF_CF11_POS                            (11U)
#define MCAN_TXBCF_CF11                                (0x00000800UL)
#define MCAN_TXBCF_CF12_POS                            (12U)
#define MCAN_TXBCF_CF12                                (0x00001000UL)
#define MCAN_TXBCF_CF13_POS                            (13U)
#define MCAN_TXBCF_CF13                                (0x00002000UL)
#define MCAN_TXBCF_CF14_POS                            (14U)
#define MCAN_TXBCF_CF14                                (0x00004000UL)
#define MCAN_TXBCF_CF15_POS                            (15U)
#define MCAN_TXBCF_CF15                                (0x00008000UL)
#define MCAN_TXBCF_CF16_POS                            (16U)
#define MCAN_TXBCF_CF16                                (0x00010000UL)
#define MCAN_TXBCF_CF17_POS                            (17U)
#define MCAN_TXBCF_CF17                                (0x00020000UL)
#define MCAN_TXBCF_CF18_POS                            (18U)
#define MCAN_TXBCF_CF18                                (0x00040000UL)
#define MCAN_TXBCF_CF19_POS                            (19U)
#define MCAN_TXBCF_CF19                                (0x00080000UL)
#define MCAN_TXBCF_CF20_POS                            (20U)
#define MCAN_TXBCF_CF20                                (0x00100000UL)
#define MCAN_TXBCF_CF21_POS                            (21U)
#define MCAN_TXBCF_CF21                                (0x00200000UL)
#define MCAN_TXBCF_CF22_POS                            (22U)
#define MCAN_TXBCF_CF22                                (0x00400000UL)
#define MCAN_TXBCF_CF23_POS                            (23U)
#define MCAN_TXBCF_CF23                                (0x00800000UL)
#define MCAN_TXBCF_CF24_POS                            (24U)
#define MCAN_TXBCF_CF24                                (0x01000000UL)
#define MCAN_TXBCF_CF25_POS                            (25U)
#define MCAN_TXBCF_CF25                                (0x02000000UL)
#define MCAN_TXBCF_CF26_POS                            (26U)
#define MCAN_TXBCF_CF26                                (0x04000000UL)
#define MCAN_TXBCF_CF27_POS                            (27U)
#define MCAN_TXBCF_CF27                                (0x08000000UL)
#define MCAN_TXBCF_CF28_POS                            (28U)
#define MCAN_TXBCF_CF28                                (0x10000000UL)
#define MCAN_TXBCF_CF29_POS                            (29U)
#define MCAN_TXBCF_CF29                                (0x20000000UL)
#define MCAN_TXBCF_CF30_POS                            (30U)
#define MCAN_TXBCF_CF30                                (0x40000000UL)
#define MCAN_TXBCF_CF31_POS                            (31U)
#define MCAN_TXBCF_CF31                                (0x80000000UL)

/*  Bit definition for MCAN_TXBTIE register  */
#define MCAN_TXBTIE_TIE0_POS                           (0U)
#define MCAN_TXBTIE_TIE0                               (0x00000001UL)
#define MCAN_TXBTIE_TIE1_POS                           (1U)
#define MCAN_TXBTIE_TIE1                               (0x00000002UL)
#define MCAN_TXBTIE_TIE2_POS                           (2U)
#define MCAN_TXBTIE_TIE2                               (0x00000004UL)
#define MCAN_TXBTIE_TIE3_POS                           (3U)
#define MCAN_TXBTIE_TIE3                               (0x00000008UL)
#define MCAN_TXBTIE_TIE4_POS                           (4U)
#define MCAN_TXBTIE_TIE4                               (0x00000010UL)
#define MCAN_TXBTIE_TIE5_POS                           (5U)
#define MCAN_TXBTIE_TIE5                               (0x00000020UL)
#define MCAN_TXBTIE_TIE6_POS                           (6U)
#define MCAN_TXBTIE_TIE6                               (0x00000040UL)
#define MCAN_TXBTIE_TIE7_POS                           (7U)
#define MCAN_TXBTIE_TIE7                               (0x00000080UL)
#define MCAN_TXBTIE_TIE8_POS                           (8U)
#define MCAN_TXBTIE_TIE8                               (0x00000100UL)
#define MCAN_TXBTIE_TIE9_POS                           (9U)
#define MCAN_TXBTIE_TIE9                               (0x00000200UL)
#define MCAN_TXBTIE_TIE10_POS                          (10U)
#define MCAN_TXBTIE_TIE10                              (0x00000400UL)
#define MCAN_TXBTIE_TIE11_POS                          (11U)
#define MCAN_TXBTIE_TIE11                              (0x00000800UL)
#define MCAN_TXBTIE_TIE12_POS                          (12U)
#define MCAN_TXBTIE_TIE12                              (0x00001000UL)
#define MCAN_TXBTIE_TIE13_POS                          (13U)
#define MCAN_TXBTIE_TIE13                              (0x00002000UL)
#define MCAN_TXBTIE_TIE14_POS                          (14U)
#define MCAN_TXBTIE_TIE14                              (0x00004000UL)
#define MCAN_TXBTIE_TIE15_POS                          (15U)
#define MCAN_TXBTIE_TIE15                              (0x00008000UL)
#define MCAN_TXBTIE_TIE16_POS                          (16U)
#define MCAN_TXBTIE_TIE16                              (0x00010000UL)
#define MCAN_TXBTIE_TIE17_POS                          (17U)
#define MCAN_TXBTIE_TIE17                              (0x00020000UL)
#define MCAN_TXBTIE_TIE18_POS                          (18U)
#define MCAN_TXBTIE_TIE18                              (0x00040000UL)
#define MCAN_TXBTIE_TIE19_POS                          (19U)
#define MCAN_TXBTIE_TIE19                              (0x00080000UL)
#define MCAN_TXBTIE_TIE20_POS                          (20U)
#define MCAN_TXBTIE_TIE20                              (0x00100000UL)
#define MCAN_TXBTIE_TIE21_POS                          (21U)
#define MCAN_TXBTIE_TIE21                              (0x00200000UL)
#define MCAN_TXBTIE_TIE22_POS                          (22U)
#define MCAN_TXBTIE_TIE22                              (0x00400000UL)
#define MCAN_TXBTIE_TIE23_POS                          (23U)
#define MCAN_TXBTIE_TIE23                              (0x00800000UL)
#define MCAN_TXBTIE_TIE24_POS                          (24U)
#define MCAN_TXBTIE_TIE24                              (0x01000000UL)
#define MCAN_TXBTIE_TIE25_POS                          (25U)
#define MCAN_TXBTIE_TIE25                              (0x02000000UL)
#define MCAN_TXBTIE_TIE26_POS                          (26U)
#define MCAN_TXBTIE_TIE26                              (0x04000000UL)
#define MCAN_TXBTIE_TIE27_POS                          (27U)
#define MCAN_TXBTIE_TIE27                              (0x08000000UL)
#define MCAN_TXBTIE_TIE28_POS                          (28U)
#define MCAN_TXBTIE_TIE28                              (0x10000000UL)
#define MCAN_TXBTIE_TIE29_POS                          (29U)
#define MCAN_TXBTIE_TIE29                              (0x20000000UL)
#define MCAN_TXBTIE_TIE30_POS                          (30U)
#define MCAN_TXBTIE_TIE30                              (0x40000000UL)
#define MCAN_TXBTIE_TIE31_POS                          (31U)
#define MCAN_TXBTIE_TIE31                              (0x80000000UL)

/*  Bit definition for MCAN_TXBCIE register  */
#define MCAN_TXBCIE_CFIE0_POS                          (0U)
#define MCAN_TXBCIE_CFIE0                              (0x00000001UL)
#define MCAN_TXBCIE_CFIE1_POS                          (1U)
#define MCAN_TXBCIE_CFIE1                              (0x00000002UL)
#define MCAN_TXBCIE_CFIE2_POS                          (2U)
#define MCAN_TXBCIE_CFIE2                              (0x00000004UL)
#define MCAN_TXBCIE_CFIE3_POS                          (3U)
#define MCAN_TXBCIE_CFIE3                              (0x00000008UL)
#define MCAN_TXBCIE_CFIE4_POS                          (4U)
#define MCAN_TXBCIE_CFIE4                              (0x00000010UL)
#define MCAN_TXBCIE_CFIE5_POS                          (5U)
#define MCAN_TXBCIE_CFIE5                              (0x00000020UL)
#define MCAN_TXBCIE_CFIE6_POS                          (6U)
#define MCAN_TXBCIE_CFIE6                              (0x00000040UL)
#define MCAN_TXBCIE_CFIE7_POS                          (7U)
#define MCAN_TXBCIE_CFIE7                              (0x00000080UL)
#define MCAN_TXBCIE_CFIE8_POS                          (8U)
#define MCAN_TXBCIE_CFIE8                              (0x00000100UL)
#define MCAN_TXBCIE_CFIE9_POS                          (9U)
#define MCAN_TXBCIE_CFIE9                              (0x00000200UL)
#define MCAN_TXBCIE_CFIE10_POS                         (10U)
#define MCAN_TXBCIE_CFIE10                             (0x00000400UL)
#define MCAN_TXBCIE_CFIE11_POS                         (11U)
#define MCAN_TXBCIE_CFIE11                             (0x00000800UL)
#define MCAN_TXBCIE_CFIE12_POS                         (12U)
#define MCAN_TXBCIE_CFIE12                             (0x00001000UL)
#define MCAN_TXBCIE_CFIE13_POS                         (13U)
#define MCAN_TXBCIE_CFIE13                             (0x00002000UL)
#define MCAN_TXBCIE_CFIE14_POS                         (14U)
#define MCAN_TXBCIE_CFIE14                             (0x00004000UL)
#define MCAN_TXBCIE_CFIE15_POS                         (15U)
#define MCAN_TXBCIE_CFIE15                             (0x00008000UL)
#define MCAN_TXBCIE_CFIE16_POS                         (16U)
#define MCAN_TXBCIE_CFIE16                             (0x00010000UL)
#define MCAN_TXBCIE_CFIE17_POS                         (17U)
#define MCAN_TXBCIE_CFIE17                             (0x00020000UL)
#define MCAN_TXBCIE_CFIE18_POS                         (18U)
#define MCAN_TXBCIE_CFIE18                             (0x00040000UL)
#define MCAN_TXBCIE_CFIE19_POS                         (19U)
#define MCAN_TXBCIE_CFIE19                             (0x00080000UL)
#define MCAN_TXBCIE_CFIE20_POS                         (20U)
#define MCAN_TXBCIE_CFIE20                             (0x00100000UL)
#define MCAN_TXBCIE_CFIE21_POS                         (21U)
#define MCAN_TXBCIE_CFIE21                             (0x00200000UL)
#define MCAN_TXBCIE_CFIE22_POS                         (22U)
#define MCAN_TXBCIE_CFIE22                             (0x00400000UL)
#define MCAN_TXBCIE_CFIE23_POS                         (23U)
#define MCAN_TXBCIE_CFIE23                             (0x00800000UL)
#define MCAN_TXBCIE_CFIE24_POS                         (24U)
#define MCAN_TXBCIE_CFIE24                             (0x01000000UL)
#define MCAN_TXBCIE_CFIE25_POS                         (25U)
#define MCAN_TXBCIE_CFIE25                             (0x02000000UL)
#define MCAN_TXBCIE_CFIE26_POS                         (26U)
#define MCAN_TXBCIE_CFIE26                             (0x04000000UL)
#define MCAN_TXBCIE_CFIE27_POS                         (27U)
#define MCAN_TXBCIE_CFIE27                             (0x08000000UL)
#define MCAN_TXBCIE_CFIE28_POS                         (28U)
#define MCAN_TXBCIE_CFIE28                             (0x10000000UL)
#define MCAN_TXBCIE_CFIE29_POS                         (29U)
#define MCAN_TXBCIE_CFIE29                             (0x20000000UL)
#define MCAN_TXBCIE_CFIE30_POS                         (30U)
#define MCAN_TXBCIE_CFIE30                             (0x40000000UL)
#define MCAN_TXBCIE_CFIE31_POS                         (31U)
#define MCAN_TXBCIE_CFIE31                             (0x80000000UL)

