ISouthRain/HC32F448-template/.pack/HDSC/HC32F448.1.0.1/Device/Include/HC32F448FAUI.h
/*  Bit definition for MPU_SCR register  */
#define MPU_SCR_SMPUBRP_POS                            (0U)
#define MPU_SCR_SMPUBRP                                (0x00000001UL)
#define MPU_SCR_SMPUBWP_POS                            (1U)
#define MPU_SCR_SMPUBWP                                (0x00000002UL)
#define MPU_SCR_SMPUACT_POS                            (2U)
#define MPU_SCR_SMPUACT                                (0x0000000CUL)
#define MPU_SCR_SMPUACT_0                              (0x00000004UL)
#define MPU_SCR_SMPUACT_1                              (0x00000008UL)
#define MPU_SCR_SMPUE_POS                              (7U)
#define MPU_SCR_SMPUE                                  (0x00000080UL)

/*******************************************************************************
                Bit definition for Peripheral PERIC
*******************************************************************************/
/*  Bit definition for PERIC_SMC_ENAR register  */
#define PERIC_SMC_ENAR_SMCEN_POS                       (1U)
#define PERIC_SMC_ENAR_SMCEN                           (0x00000002UL)

/*  Bit definition for PERIC_TMR_SYNENR register  */
#define PERIC_TMR_SYNENR_TMR0U1A_POS                   (0U)
#define PERIC_TMR_SYNENR_TMR0U1A                       (0x00000001UL)
#define PERIC_TMR_SYNENR_TMR0U1B_POS                   (1U)
#define PERIC_TMR_SYNENR_TMR0U1B                       (0x00000002UL)
#define PERIC_TMR_SYNENR_TMR0U2A_POS                   (2U)
#define PERIC_TMR_SYNENR_TMR0U2A                       (0x00000004UL)
#define PERIC_TMR_SYNENR_TMR0U2B_POS                   (3U)
#define PERIC_TMR_SYNENR_TMR0U2B                       (0x00000008UL)
#define PERIC_TMR_SYNENR_TMR4U1_POS                    (4U)
#define PERIC_TMR_SYNENR_TMR4U1                        (0x00000010UL)
#define PERIC_TMR_SYNENR_TMR4U2_POS                    (5U)
#define PERIC_TMR_SYNENR_TMR4U2                        (0x00000020UL)
#define PERIC_TMR_SYNENR_TMR4U3_POS                    (6U)
#define PERIC_TMR_SYNENR_TMR4U3                        (0x00000040UL)
#define PERIC_TMR_SYNENR_TMR6U1_POS                    (8U)
#define PERIC_TMR_SYNENR_TMR6U1                        (0x00000100UL)
#define PERIC_TMR_SYNENR_TMR6U2_POS                    (9U)
#define PERIC_TMR_SYNENR_TMR6U2                        (0x00000200UL)
#define PERIC_TMR_SYNENR_TMRAU1_POS                    (10U)
#define PERIC_TMR_SYNENR_TMRAU1                        (0x00000400UL)
#define PERIC_TMR_SYNENR_TMRAU2_POS                    (11U)
#define PERIC_TMR_SYNENR_TMRAU2                        (0x00000800UL)
#define PERIC_TMR_SYNENR_TMRAU3_POS                    (12U)
#define PERIC_TMR_SYNENR_TMRAU3                        (0x00001000UL)
#define PERIC_TMR_SYNENR_TMRAU4_POS                    (13U)
#define PERIC_TMR_SYNENR_TMRAU4                        (0x00002000UL)
#define PERIC_TMR_SYNENR_TMRAU5_POS                    (14U)
#define PERIC_TMR_SYNENR_TMRAU5                        (0x00004000UL)

/*  Bit definition for PERIC_USART1_NFC register  */
#define PERIC_USART1_NFC_USASRT1_NFS_POS               (0U)
#define PERIC_USART1_NFC_USASRT1_NFS                   (0x00000003UL)
#define PERIC_USART1_NFC_USASRT1_NFS_0                 (0x00000001UL)
#define PERIC_USART1_NFC_USASRT1_NFS_1                 (0x00000002UL)
#define PERIC_USART1_NFC_USART1_NFE_POS                (2U)
#define PERIC_USART1_NFC_USART1_NFE                    (0x00000004UL)

/*******************************************************************************
                Bit definition for Peripheral PWC
*******************************************************************************/
/*  Bit definition for PWC_FCG0 register  */
#define PWC_FCG0_SRAMH_POS                             (0U)
#define PWC_FCG0_SRAMH                                 (0x00000001UL)
#define PWC_FCG0_SRAM0_POS                             (4U)
#define PWC_FCG0_SRAM0                                 (0x00000010UL)
#define PWC_FCG0_SRAMB_POS                             (10U)
#define PWC_FCG0_SRAMB                                 (0x00000400UL)
#define PWC_FCG0_KEY_POS                               (13U)
#define PWC_FCG0_KEY                                   (0x00002000UL)
#define PWC_FCG0_DMA1_POS                              (14U)
#define PWC_FCG0_DMA1                                  (0x00004000UL)
#define PWC_FCG0_DMA2_POS                              (15U)
#define PWC_FCG0_DMA2                                  (0x00008000UL)
#define PWC_FCG0_FCM_POS                               (16U)
#define PWC_FCG0_FCM                                   (0x00010000UL)
#define PWC_FCG0_AOS_POS                               (17U)
#define PWC_FCG0_AOS                                   (0x00020000UL)
#define PWC_FCG0_CTC_POS                               (18U)
#define PWC_FCG0_CTC                                   (0x00040000UL)
#define PWC_FCG0_AES_POS                               (20U)
#define PWC_FCG0_AES                                   (0x00100000UL)
#define PWC_FCG0_HASH_POS                              (21U)
#define PWC_FCG0_HASH                                  (0x00200000UL)
#define PWC_FCG0_TRNG_POS                              (22U)
#define PWC_FCG0_TRNG                                  (0x00400000UL)
#define PWC_FCG0_CRC_POS                               (23U)
#define PWC_FCG0_CRC                                   (0x00800000UL)
#define PWC_FCG0_DCU1_POS                              (24U)
#define PWC_FCG0_DCU1                                  (0x01000000UL)
#define PWC_FCG0_DCU2_POS                              (25U)
#define PWC_FCG0_DCU2                                  (0x02000000UL)
#define PWC_FCG0_DCU3_POS                              (26U)
#define PWC_FCG0_DCU3                                  (0x04000000UL)
#define PWC_FCG0_DCU4_POS                              (27U)
#define PWC_FCG0_DCU4                                  (0x08000000UL)

/*  Bit definition for PWC_FCG1 register  */
#define PWC_FCG1_MCAN1_POS                             (0U)
#define PWC_FCG1_MCAN1                                 (0x00000001UL)
#define PWC_FCG1_MCAN2_POS                             (1U)
#define PWC_FCG1_MCAN2                                 (0x00000002UL)
#define PWC_FCG1_QSPI_POS                              (3U)
#define PWC_FCG1_QSPI                                  (0x00000008UL)
#define PWC_FCG1_I2C1_POS                              (4U)
#define PWC_FCG1_I2C1                                  (0x00000010UL)
#define PWC_FCG1_I2C2_POS                              (5U)
#define PWC_FCG1_I2C2                                  (0x00000020UL)
#define PWC_FCG1_SPI1_POS                              (16U)
#define PWC_FCG1_SPI1                                  (0x00010000UL)
#define PWC_FCG1_SPI2_POS                              (17U)
#define PWC_FCG1_SPI2                                  (0x00020000UL)
#define PWC_FCG1_SPI3_POS                              (18U)
#define PWC_FCG1_SPI3                                  (0x00040000UL)

/*  Bit definition for PWC_FCG2 register  */
#define PWC_FCG2_TMR6_1_POS                            (0U)
#define PWC_FCG2_TMR6_1                                (0x00000001UL)
#define PWC_FCG2_TMR6_2_POS                            (1U)
#define PWC_FCG2_TMR6_2                                (0x00000002UL)
#define PWC_FCG2_TMR4_1_POS                            (9U)
#define PWC_FCG2_TMR4_1                                (0x00000200UL)
#define PWC_FCG2_TMR4_2_POS                            (10U)
#define PWC_FCG2_TMR4_2                                (0x00000400UL)
#define PWC_FCG2_TMR4_3_POS                            (11U)
#define PWC_FCG2_TMR4_3                                (0x00000800UL)
#define PWC_FCG2_TMR0_1_POS                            (12U)
#define PWC_FCG2_TMR0_1                                (0x00001000UL)
#define PWC_FCG2_TMR0_2_POS                            (13U)
#define PWC_FCG2_TMR0_2                                (0x00002000UL)
#define PWC_FCG2_EMB_POS                               (15U)
#define PWC_FCG2_EMB                                   (0x00008000UL)
#define PWC_FCG2_TMRA_1_POS                            (20U)
#define PWC_FCG2_TMRA_1                                (0x00100000UL)
#define PWC_FCG2_TMRA_2_POS                            (21U)
#define PWC_FCG2_TMRA_2                                (0x00200000UL)
#define PWC_FCG2_TMRA_3_POS                            (22U)
#define PWC_FCG2_TMRA_3                                (0x00400000UL)
#define PWC_FCG2_TMRA_4_POS                            (23U)
#define PWC_FCG2_TMRA_4                                (0x00800000UL)
#define PWC_FCG2_TMRA_5_POS                            (24U)
#define PWC_FCG2_TMRA_5                                (0x01000000UL)

